<?php

return [
    'movie' => 'Фільм',
    'tv_series' => 'ТВ серіал',
    'animated_movie' => 'Мультфільм',
    'animated_series' => 'Мультсеріал',
    'anime' => 'Аніме',

    'movie_name' => 'Фільм',
    'tv_series_name' => 'ТВ серіал',
    'animated_movie_name' => 'Мультфільм',
    'animated_series_name' => 'Мультсеріал',
    'anime_name' => 'Аніме',

    'movie_description' => 'Повнометражний фільм, який триває від 1 до кількох годин.',
    'tv_series_description' => 'Телекінематографічний серіал, який складається з кількох сезонів.',
    'animated_movie_description' => 'Мультфільм, який представляє собою анімацію у вигляді повнометражного фільму.',
    'animated_series_description' => 'Мультсеріал, що складається з кількох епізодів, де основна історія розгортається в анімаційному форматі.',
    'anime_description' => 'Японська анімація, що включає як серіали, так і фільми, із характерним стилем та сюжетом.',

    'movie_meta_title' => 'Фільми онлайн | Кінопортал',
    'tv_series_meta_title' => 'ТВ серіали онлайн | Кінопортал',
    'animated_movie_meta_title' => 'Мультфільми онлайн | Кінопортал',
    'animated_series_meta_title' => 'Мультсеріали онлайн | Кінопортал',
    'anime_meta_title' => 'Аніме онлайн | Кінопортал',

    'movie_meta_description' => 'Перегляньте найкращі фільми онлайн, від класики до новинок кіноіндустрії.',
    'tv_series_meta_description' => 'Ознайомтеся з найкращими ТВ серіалами онлайн, від комедій до драм.',
    'animated_movie_meta_description' => 'Перегляньте анімаційні фільми, що захоплюють своєю графікою та сюжетами.',
    'animated_series_meta_description' => 'Дивіться мультсеріали для всіх вікових категорій онлайн.',
    'anime_meta_description' => 'Огляньте кращі аніме серіали та фільми онлайн, від популярних до рідкісних тайтлів.',
];
