<?php

return [
    'g' => 'G',
    'pg' => 'PG',
    'pg_13' => 'PG-13',
    'r' => 'R',
    'nc_17' => 'NC-17',

    'g_hint' => 'Підходить для всіх вікових груп.',
    'pg_hint' => 'Рекомендовано для загальної аудиторії.',
    'pg_13_hint' => 'Дозволено для глядачів від 13 років і старше.',
    'r_hint' => 'Обмеження для глядачів старше 17 років.',
    'nc_17_hint' => 'Тільки для глядачів старше 18 років.',

    'g_meta_title' => 'Фільми і серіали з рейтингом G',
    'pg_meta_title' => 'Фільми і серіали з рейтингом PG',
    'pg_13_meta_title' => 'Фільми і серіали з рейтингом PG-13',
    'r_meta_title' => 'Фільми і серіали з рейтингом R',
    'nc_17_meta_title' => 'Фільми і серіали з рейтингом NC-17',

    'g_meta_description' => 'Фільми, які підходять для всіх вікових категорій.',
    'pg_meta_description' => 'Фільми, які підходять для загальної аудиторії без суворих обмежень.',
    'pg_13_meta_description' => 'Фільми, дозволені для глядачів від 13 років.',
    'r_meta_description' => 'Фільми для глядачів старше 17 років через вміст із насильством або іншими обмеженнями.',
    'nc_17_meta_description' => 'Фільми для глядачів старше 18 років із інтенсивним вмістом.',
];
