<?php

return [
    'anons' => 'Анонс',
    'ongoing' => 'У процесі',
    'released' => 'Випущено',
    'canceled' => 'Скасовано',
    'rumored' => 'На розгляді',

    'anons_description' => 'Нові фільми та серіали, які скоро з\'являться на екранах.',
    'ongoing_description' => 'Фільми та серіали, що зараз показуються або випускаються епізодами.',
    'released_description' => 'Фільми та серіали, які вже доступні до перегляду.',
    'canceled_description' => 'Проекти, які були скасовані і більше не будуть випущені.',
    'rumored_description' => 'Проекти, які знаходяться на стадії розгляду і ще не були офіційно анонсовані.',

    'anons_meta_title' => 'Анонс нових фільмів та серіалів | Кінопортал',
    'ongoing_meta_title' => 'Серіали та фільми у процесі показу | Кінопортал',
    'released_meta_title' => 'Доступні фільми та серіали | Кінопортал',
    'canceled_meta_title' => 'Скасовані проекти | Кінопортал',
    'rumored_meta_title' => 'Проекти на розгляді | Кінопортал',

    'anons_meta_description' => 'Дізнайтеся про нові анонси фільмів та серіалів, які скоро будуть доступні на великому екрані.',
    'ongoing_meta_description' => 'Ознайомтеся з фільмами та серіалами, які зараз виходять, і залишайтеся в курсі нових епізодів.',
    'released_meta_description' => 'Перегляньте всі доступні фільми та серіали, що вже випущені для перегляду.',
    'canceled_meta_description' => 'Дізнайтеся про фільми та серіали, які були скасовані і більше не будуть випущені.',
    'rumored_meta_description' => 'Перегляньте фільми та серіали, які зараз на розгляді і ще не підтверджені.',
];
