<?php

return [
    'sd' => 'Стандартне визначення (SD)',
    'hd' => 'Висока якість (HD)',
    'full_hd' => 'Повне HD (Full HD)',
    'uhd' => 'Ультрависока якість (UHD)',

    'meta_title' => [
        'sd' => 'Стандартне визначення (SD) - Погляньте на якість відео',
        'hd' => 'Висока якість (HD) - Насолоджуйтеся чітким відео',
        'full_hd' => 'Повне HD (Full HD) - Відео з найкращою якістю',
        'uhd' => 'Ультрависока якість (UHD) - Чіткість без компромісів',
    ],

    'meta_description' => [
        'sd' => 'Відео з якістю стандартного визначення, ідеально підходить для старих пристроїв.',
        'hd' => 'Висока якість відео для кращих деталей і чіткості.',
        'full_hd' => 'Відео в Full HD роздільній здатності для найкращого перегляду.',
        'uhd' => 'Ультрависока якість з чіткістю до 4K для неймовірно реалістичного зображення.',
    ],

    'meta_image' => [
        'sd' => 'url_to_sd_image.jpg',
        'hd' => 'url_to_hd_image.jpg',
        'full_hd' => 'url_to_full_hd_image.jpg',
        'uhd' => 'url_to_uhd_image.jpg',
    ],
];
