<?php

namespace Liamtseva\Cinema\Enums;

enum Source: string
{
    case DORAMA = 'dorama';
    case MANGA = 'manga';
    case GAME = 'game';
    case NOVEL = 'novel';
    case COMIC = 'comic';
    case LIGHT_NOVEL = 'light_novel';
    case WEBTOON = 'webtoon';
    case TV_SHOW = 'tv_show';
    case MOVIE = 'movie';

    public function name(): string
    {
        return match ($this) {
            self::DORAMA => 'Дорама',
            self::MANGA => 'Манга',
            self::GAME => 'Гра',
            self::NOVEL => 'Роман',
            self::COMIC => 'Комікс',
            self::LIGHT_NOVEL => 'Лайт-новел',
            self::WEBTOON => 'Вебтун',
            self::TV_SHOW => 'Телешоу',
            self::MOVIE => 'Фільм',
        };
    }

    public function description(): string
    {
        return match ($this) {
            self::DORAMA => 'Дорама — це популярний жанр японських або корейських телевізійних серіалів, які часто базуються на манзі чи романах.',
            self::MANGA => 'Манга — японські комікси, які часто стають основою для аніме або фільмів.',
            self::GAME => 'Гри, на основі яких створюються аніме, фільми або серіали, часто мають своїх унікальних персонажів та сюжет.',
            self::NOVEL => 'Роман — це літературний твір, який часто адаптується в інші формати, такі як фільми чи серіали.',
            self::COMIC => 'Комікси — це твори в жанрі малюнкової графіки, що можуть стати основою для адаптацій в кіно чи аніме.',
            self::LIGHT_NOVEL => 'Лайт-новели — японські короткі романи з ілюстраціями, часто адаптовані в аніме або мангу.',
            self::WEBTOON => 'Вебтуни — це цифрові комікси, що публікуються онлайн, часто мають захоплюючі сюжети та персонажів.',
            self::TV_SHOW => 'Телешоу — різноманітні телевізійні програми, серіали та реаліті-шоу, що можуть служити основою для фільмів або аніме.',
            self::MOVIE => 'Фільми — це кінематографічні твори, часто створюються на основі книг, коміксів або реальних подій.',
        };
    }

    public function metaTitle(): string
    {
        return match ($this) {
            self::DORAMA => 'Дорама: Твори японської та корейської культури',
            self::MANGA => 'Манга: Сучасні японські комікси та їх екранізації',
            self::GAME => 'Гри, що стали основою для кіно та аніме',
            self::NOVEL => 'Романи, що адаптовані в кіно та серіали',
            self::COMIC => 'Комікси: Від класики до сучасних адаптацій',
            self::LIGHT_NOVEL => 'Лайт-новели: Від тексту до аніме',
            self::WEBTOON => 'Вебтуни: Цифрові комікси для сучасної аудиторії',
            self::TV_SHOW => 'Телешоу: Експлорація формату з усіх куточків світу',
            self::MOVIE => 'Фільми: Кінематографічні шедеври та їх адаптації',
        };
    }

    public function metaDescription(): string
    {
        return match ($this) {
            self::DORAMA => 'Дорама — це японські та корейські телевізійні серіали, які здобули популярність завдяки емоційному сюжету та глибоким персонажам.',
            self::MANGA => 'Манга — це японські комікси, відомі своїм унікальним стилем та сюжетами, які часто адаптуються в аніме чи фільми.',
            self::GAME => 'Гри часто стають основою для кінофільмів або аніме, що дозволяє геймерам насолоджуватися своїми улюбленими персонажами та світом в інших форматах.',
            self::NOVEL => 'Романи часто перетворюються на фільми та серіали, надаючи нове життя літературним творам, що вражають читачів глибокими сюжетами.',
            self::COMIC => 'Комікси, від класичних до сучасних, стають основою для великих екранізацій, привертаючи увагу фанатів у всьому світі.',
            self::LIGHT_NOVEL => 'Лайт-новели — це короткі японські романи з ілюстраціями, які часто адаптовані в аніме або мангу, привертаючи увагу молодої аудиторії.',
            self::WEBTOON => 'Вебтуни — це цифрові комікси, які публікуються онлайн, і мають великий вплив на молодіжну культуру та сучасний кінематограф.',
            self::TV_SHOW => 'Телешоу стали невід’ємною частиною поп-культури, вражаючи глядачів новими форматами та розважальними програмами.',
            self::MOVIE => 'Фільми — це кінематографічні твори, які часто адаптують книги, комікси або реальні події в захоплюючі історії для широкої аудиторії.',
        };
    }

    public function metaImage(): string
    {
        return match ($this) {
            self::DORAMA => '/images/seo/dorama.jpg',
            self::MANGA => '/images/seo/manga.jpg',
            self::GAME => '/images/seo/game.jpg',
            self::NOVEL => '/images/seo/novel.jpg',
            self::COMIC => '/images/seo/comic.jpg',
            self::LIGHT_NOVEL => '/images/seo/light_novel.jpg',
            self::WEBTOON => '/images/seo/webtoon.jpg',
            self::TV_SHOW => '/images/seo/tv_show.jpg',
            self::MOVIE => '/images/seo/movie.jpg',
        };
    }
}
